In [6]:
import pandas as pd

In [118]:
df=pd.read_csv("decision_tree.csv")
df.head()

  Company                  Job     Degree  Salary_more_than_100k
0  google      Sales executive  bachelors                      0
1  google      Sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [119]:
inputs=df.drop('Salary_more_than_100k',axis='columns')
targets=df['Salary_more_than_100k']

In [7]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [121]:
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [122]:
inputs['company_n']=le_company.fit_transform(inputs['Company'])
inputs['job_n']=le_company.fit_transform(inputs['Job'])
inputs['degree_n']=le_company.fit_transform(inputs['Degree'])

In [123]:
inputs_n=inputs.drop(['Company','Job','Degree'],axis='columns')
inputs_n.head(15)

    company_n  job_n  degree_n
0           2      0         0
1           2      0         1
2           2      1         0
3           2      1         1
4           2      2         0
5           2      2         1
6           0      0         1
7           0      2         0
8           0      1         0
9           0      1         1
10          1      0         0
11          1      0         1
12          1      1         0
13          1      1         1
14          1      2         0

In [8]:
from sklearn import tree
model=tree.DecisionTreeClassifier()

In [125]:
model.fit(inputs_n,targets)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [126]:
model.score(inputs_n,targets)

1.0

In [127]:
model.predict([[2,0,2]])

array([0], dtype=int64)

# TITANIC DATASET

In [9]:
dft=pd.read_csv('titanic.csv')
dft.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
dft=dft.interpolate(method='linear')
dft.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
inputs1=dft.drop(['PassengerId','Survived','Name','SibSp','Parch','Ticket','Fare','Cabin'],axis=1)
targets1=dft['Survived']

In [12]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [2]:
#inputs1['Embarked']=inputs1['Embarked'].replace({'S':'southampton','C':'cherbourg','Q':'queenstown',})

In [13]:
inputs1

     Pclass     Sex   Age Embarked
0         3    male  22.0        S
1         1  female  38.0        C
2         3  female  26.0        S
3         1  female  35.0        S
4         3    male  35.0        S
..      ...     ...   ...      ...
886       2    male  27.0        S
887       1  female  19.0        S
888       3  female  22.5        S
889       1    male  26.0        C
890       3    male  32.0        Q

[891 rows x 4 columns]

In [14]:
inputs1['sex_n']=le.fit_transform(inputs1['Sex'])

In [15]:
embarked=pd.get_dummies(inputs1['Embarked'])

In [16]:
inputs1=pd.concat([inputs1,embarked],axis=1)
inputs1=inputs1.drop(['Embarked','Sex'],axis=1)
inputs1.head()

   Pclass   Age  sex_n  C  Q  S
0       3  22.0      1  0  0  1
1       1  38.0      0  1  0  0
2       3  26.0      0  0  0  1
3       1  35.0      0  0  0  1
4       3  35.0      1  0  0  1

In [17]:
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test=train_test_split(inputs1,targets1,test_size=0.2)

In [19]:
model.fit(X_test,Y_test)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [20]:
model.score(X_test,Y_test)

0.9553072625698324

In [158]:
model.fit(inputs1,targets1)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [159]:
model.score(inputs1,targets1)

0.9180695847362514

In [21]:
inputs1

     Pclass   Age  sex_n  C  Q  S
0         3  22.0      1  0  0  1
1         1  38.0      0  1  0  0
2         3  26.0      0  0  0  1
3         1  35.0      0  0  0  1
4         3  35.0      1  0  0  1
..      ...   ...    ... .. .. ..
886       2  27.0      1  0  0  1
887       1  19.0      0  0  0  1
888       3  22.5      0  0  0  1
889       1  26.0      1  1  0  0
890       3  32.0      1  0  1  0

[891 rows x 6 columns]

In [25]:
model.predict([[3,35.0,1,0,0,1]])

array([0], dtype=int64)

In [24]:
targets1

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64